{
  "title": " بكار يهوم نسرين ",
  "description": "الموقع الشخصي لمطوة ويب متخصصة في تطوير الواجهة الأمامية مع مهارات في تطوير الواجهة الخلفية و تطوير برامج الهاتف",
  "photo_alt": " بكار يهوم نسرين",
  "logo_alt": "لوغو الموقع ",

  "home_title": "الصفحة الرئيسية",
  "home_id": "الصفحةالرئيسية",
  "home__path": "#الصفحةالرئيسية",

  "Profil_title": "لمحة",
  "Profil_id": "لمحة",
  "Profil__path": "/#لمحة",

  "skills_title": "المهارات",
  "skills_id": "المهارات",
  "skills_path": "/#المهارات",
  
  "portfolio_title": "معرض الأعمال",
  "portfolio_id": "معرضالاعمال",
  "portfolio__path": "/#معرضالأعمال",
  

  "service_title": "خدماتي",
  "service_id": "خدماتي",
  "#service_path": "/#خدماتي",

  "contact_title": "تواصل معنا",
  "contact_id": "تواصلمعنا",
  "contact_path": "/#تواصلمعنا",
  
  "txtInfo":"مزيد من المعلومات",
  "footer":" جميع الحقوق محفوظة© 2023  بكار يهوم نسرين  ",
 "Mentions": "إشعار قانوني",
 "plan": "خطة الموقع",

 "Download": "تحميل سيرتي الذاتية",
  "all": "الكل",
  "software": "البرامج",
  "Mobile": "الموبايل",
  "Technologies_used": "التكنلوجيا المستعملة",
  "Readmore": "إقرأ المزيد",
  "Send": "إرسال",
  "firstName": "الاسم",
  "lastName": "اللقب",
  "Email": "البريد الإلكتروني",
  "Message": "الرسالة",
  "Demo": "عرض",
  "source_code": "الكود المصدري",
  "email_envoyer": "تم إرسال بريدك الإلكتروني بنجاح. سأقوم بالرد عليكم في أقرب وقت ممكن",
  "WEB": "الويب",
  "Réferencement Naturel SEO" :"المرجع الطبيعي للمواقع",
  "Veille technologique": "مراقبة التكنولوجيا",
  "rotate":" شهاداتي",

  "le développement": "التنمية",
  "la Programmation" :"البرمجة",
  "le web" : "الويب",
  "la technologie!": "التكنولوجيا",
  "love": "أنا أحب",

  "lan": "مرحبا",
  "world": "بالجميع ",
  "Visiteurs": " بالزائرين",
  "Recruteur": "بالمجندين",
  "Développeurs": "بالمطورين" ,
  "dot":"؟",
  "presentation": {
    "h1Text" : " بكار يهوم نسرين " ,
    "h2Text" :  " مطورة و متكامل الويب"
   
    },

  "main_heading": {
    "hello": "مرحبا  ",
    "name": " أنا نسرين",
    "static_desc": " أنا مطورة ويب",
    "dynamic_desc": " متخصصة في تطوير الواجهة الأمامية"
  },
  "description_info": {
    "main": "مطورة ويب حاصلة على شهادة في تطوير  الويب بفرنسا ، شغوفة و محبة و متحمسة جدا لتعلم كل جديد في عالم تطوير الويب ،كمتعلمة ذاتية اتطلع دائما لتعلم تقنيات جديدة لتحسين و صقل مهاراتي .\n إكتسبت  مهارات  و  خبرات  من  خلال  العمل  على  العديد  من  المشاريع  ،هدفي  هو  تقديم  حلول  ابداعية  و  مبتكرة  لأي  مشروع  أعمل  عليه و لدي فضول كبير و موهوبة بالتقنيات الجديدة، وأسعى باستمرار إلى تحسين مهاراتي، حيث علمت نفسي، بدءًا من بعض المعرفة بالويب ومصممة الويب، تمكنت من أن أصبح مطورة ويب.وأنا  جداً متحمسة دائمًا للتعلم واكتشاف الفرص الجديدة في مجال تطوير الويب ",
    "introduction": "أنا نسرين مُدمجة ويب ومطوّرة متحمسة لعالم تطوير الويب. كمتعلّمة ذاتية، أتعلم باستمرار تقنيات ونهجًا جديدة لتحسين مهاراتي وتقديم تجارب مستخدم فريدة. حاصلة على شهادة في تكامل الويب   ، وقد عملت على العديد من المشاريع الشخصية لتعزيز مهاراتي كمُدمجة ويب ومطوّرة هدفي هو الاستمرار في التعلّم والتطور كمحترفة في مجال تطوير الويب، مع تقديم حلول إبداعية ومبتكرة لأي مشروع ويب كمُدمجة ويب، اكتسبت خبرة قوية في تطوير مواقع ويب حديثة ووظيفية باستخدام أحدث التقنيات في مجال تطوير الويب. أنا أيضًا متحمسة لتصميم واجهات مستخدم جذابة وبديهية لتقديم تجارب مستخدم مثالية. أنا حاليًا أبحث عن وظيفة بدوام كامل أو بدوام جزئي، وأنا منفتحة لأي فرص جديدة "
  },

 
  "ErrorPage": {
    "message__title": "صفحة غير متاحة",
    "message__text": " نعتذر، الصفحة المطلوبة غير موجودة .",
    "message__btn": "العودة للصفحة الرئيسية"
  },
  "projectBooki": {
    "brief_description": " موقع يسمح لك بحجز فندق في اي مكان تريده و الإطلاع على الانشطة  الموجودة في ذلك المكان   ",
    "description_project": " بوكي  هو أول مشروع تطوير ويب عملت عليه في تدريب تكامل الويب  قمت بإنشاء موقع اعتمادا  على تصميم معد ، بدأت بتحليل التصميم تم تطبيقه. اتبعت أفضل ممارسات تطوير الويب واحترمت المعايير الجودة المعتمدة.كما تأكدت من أن الموقع الويب يكون متكيفًا، أي أنه يتكيف تلقائيًا مع أنواع وأحجام شاشات مختلفة "
  },
  "projectOhMyFood": {
    "brief_description": "موقع إلكتروني للمطاعم الفاخرة. يستطيع العملاء  تركيب قائمة الطعام الخاصة بهم قبل وصولهم حتى تكون الأطباق جاهزة حسب تفضيلاتهم",
    "description_project": " هو موقع ويب يستهدف الهواتف المحمولة، يقدم قوائم المطاعم الفاخرة. تمثلت مهمتي كمطورة ويب في هذا المشروع تحويل النماذج التي قدمها فريق التصميم إلى موقع ويب يعمل بشكل فعال ويتكيف مع الأجهزة المختلفة مثل الهواتف الذكية والأجهزة اللوحية وأجهزة الكمبيوتر المكتبية.\n وفي إطار هذا المشروع، كان علي تضمين الرسوم المتحركة والتصرفات المحددة في نموذج الموقع لتوفير تجربة مستخدم ممتازة وجذابة. هذه التجربة المهنية قدمت لي الفرصة لتطبيق مهاراتي في تكامل الويب وتقديم نتائج عالية الجودة في المواعيد المحددة"
  },
  "projectLaPantherre": {
    "brief_description": "هذا موقع ويب من وكالة ويب لإجراء تدقيق وتحليل واختبار وتعديلات SEO لموقع La Panthère من أجل إمكانية الوصول وتحسين الأداء مع احترام معايير W3C." ,
    "description_project": "وكالة La Panthère لتصميم المواقع الإلكترونية، هي موقع عرض محسّن باستخدام المرجعية الطبيعية، ويهدف إلى تقديم نتائج تدقيق تحسين محركات البحث (SEO) لموقع وكالة تصميم الويب La Panthère، والتي تحتوي على قائمة غير شاملة للممارسات السيئة التي لا تؤدي إلى أي ضرر. لا تساهم في المرجع الطبيعي الجيد للموقع بالإضافة إلى ضعف إمكانية الوصول والأداء المنخفض إلى حد ما"
  },
  "projectKanap": {
    "brief_description": "هذا موقع للتجارة الإلكترونية لبيع الأرائك باستخدام جافا سكريبت",
    "description_project": "كمطور، كنت مسؤولاً عن إنشاء موقع ديناميكي باستخدام جافا سكريبت، وهو موقع للتجارة الإلكترونية يبيع كاناب (صوفات) عبر الإنترنت، وذلك من خلال إنشاء صفحة المنتج لعرض المنتج، وصفحة السلة التي يمكن للمستخدم إضافة العناصر إليها إلى السلة، وفي هذه الحالة إذا لم تكن السلة فارغة سيقوم المستخدم بملء نموذج الاتصال وصفحة التأكيد التي تحتوي على تأكيد الطلب مع رقم الطلب"
  },
  "projectPicante": {
    "brief_description": "Picante هو تطبيق مراجعة في متجر إلكتروني، تريد الشركة أن يكون الإصدار الأول “معرض صلصة”",
    "description_project": "تريد شركة المنتجات PICANTE الآن تطوير تطبيق تصنيف لصلصاتها الساخنة، يسمى HOT TAKES، وتحويله إلى متجر على الإنترنت؛ فهي تريد أن يكون الإصدار الأول عبارة عن معرض صلصة يسمح للمستخدمين بتحميل صلصاتهم الساخنة المفضلة و أحب أو لا أحب الصلصات التي يشاركها الآخرون، لذا فإن مهمتنا كمطور ويب هي إنشاء واجهة برمجة تطبيقات آمنة لتطبيق HOT TAKE."
  },
  "projectKasa": {
    "brief_description": " تطبيق مخصص لتأجير الشقق بمختلف انواعها بين الأفراد في فرنسا",
    "description_project": "تطبيق رائد في تأجير الشقق في فرنسا.\n  مهمتي كانت تجديد الموقع بإستخدام جافا سكريبت لجانب العميل  استعنت برياكت للعمل على الواجهة الأمامية ، كما كان لدي ملف جسون يحتوي على معلومات الشقق قمت بربطه مع الواجهة الأمامية ، كما استعنت بنموذج التصميم على منصة فيقما لانشاء موقع وظيفي و متكيف مع الأجهزة المختلفة مثل الهواتف الذكية والأجهزة اللوحية وأجهزة الكمبيوتر المكتبية."
  },
  "service.description": {
    "web": "إنشاء مواقع العرض، وموقع التجارة الإلكترونية، وتكامل النماذج الديناميكية مع الموقع",
     "Mobile": "في عصر يهيمن عليه الهاتف المحمول، يعد التطبيق المصمم جيدًا أكثر من مجرد أداة. إنه اتصالك المباشر بالمستخدمين أينما كنت.",
    "Referencement": "يجمع كل الأساليب والتقنيات التي تهدف إلى وضع صفحات الويب الخاصة بموقعك",
    "Veille": "البحث دائمًا عن التقنيات الجديدة"
   
  },
  "Competence":{ 
    "question": "ماذا يمكنني أن أفعل؟",
    "prgI": "تتيح لي مهاراتي المهنية أن أكون موجودًا اليوم ",
    "prgII": "وأن أمتلك المهارات التقنية التي نعرضها هنا لمحة عامة",  
    "strongWords":"مستقلة، متعددة الاستخدامات، صارمة",
    "softSkills__titleI":"ادارة مشروع",
    "softSkills__titleII":"ادارة فريق",
    "softSkills__titleIII":"علاقة العملاء", 
    "?":"؟"

  
},
"TxtCertiPrg": { 
  "p":"بعد التدريب في أوبنكلاس روم، لكي أصبح مطور ويب، تعلمت وتابعت الدورات عبر الإنترنت التي تقدمها أوبنكلاس روم، وحصلت على شهادات في نهاية الدورات",
  "lien" : "عرض الشهادات"
}

}
