{
  "nom": "عربي",
  "contenu": "<div dir='rtl'>مرحبًا بك في عالم البرمجة!</div>",
  "title": " بكار يهوم نسرين ",
  "description": "الموقع الشخصي لمطوة ويب متخصصة في تطوير الواجهة الأمامية مع مهارات في تطوير الواجهة الخلفية و تطوير برامج الهاتف",
  "photo_alt": " بكار يهوم نسرين",
  "logo_alt": "لوغو الموقع ",

  "home_title": "الصفحة الرئيسية",
  "home_id": "الصفحةالرئيسية",
  "home_path": "/#الصفحةالرئيسية",

  "Profil_title": "لمحة",
  "Profil_id": "لمحة",
  "Profil_path":"/#لمحة",

  "skills_title": "المهارات",
  "skills_id": "المهارات",
  "skills_path":"/#المهارات",

  "portfolio_title": "معرض الأعمال",
  "portfolio_id": "معرضالاعمال",
  "portfolio_path": "/#معرضالاعمال",
  
  "service_title": "خدماتي",
  "service_id": "خدماتي",
  "service_path": "/#خدماتي",
  "contact_title": "تواصل معنا",
  "contact_id": "تواصلمعنا",
  "contact_path": "/#تواصلمعنا",
  
  "txtInfo":"مزيد من المعلومات",
  "footer":" جميع الحقوق محفوظة© 2023  بكار يهوم نسرين  ",
 "Mentions": "إشعار قانوني",
 "plan": "خطة الموقع",

 "Download": "تحميل سيرتي الذاتية",
  "all": "الكل",
  "software": "البرامج",
  "Mobile": "الموبايل",
  "Technologies_used": "التكنلوجيا المستعملة",
  "Readmore": "إقرأ المزيد",
  "Send": "إرسال",
  "firstName": "الاسم",
  "lastName": "اللقب",
  "Email": "البريد الإلكتروني",
  "Message": "الرسالة",
  "Demo": "عرض",
  "source_code": "الكود المصدري",
  "email_envoyer": "تم إرسال بريدك الإلكتروني بنجاح. سأقوم بالرد عليكم في أقرب وقت ممكن",
  "WEB": "الويب",
  "Réferencement Naturel SEO" :"المرجع الطبيعي للمواقع",
  "Veille technologique": "مراقبة التكنولوجيا",
  "rotate":" شهاداتي",

  "myTextBlog": "تطوير الويب بالنسبة لي هو فن أعبر فيه عن ",
  "creativite"  : "إبداعي",
  "inspiration" : "إلهامي",
  "passion" : "شغفي",

  "lan": "مرحبا",
  "world": "بالجميع ",
  "Visiteurs": " بالزائرين",
  "Recruteur": "بالمجندين",
  "Développeurs": "بالمطورين" ,
  "dot":"؟",
  "presentation": {
    "h1Text" : " بكار يهوم نسرين " ,
    "h2Text" :  " مطورة و متكامل الويب الواجهة الأمامية"
   
    },

  "main_heading": {
    "hello": "مرحبا  ",
    "name": " أنا نسرين",
    "static_desc": "أنا  مطورة  الويب  الواجهة  الأمامية  و  تطوير  الويب  الشامل",
    "dynamic_desc": "شغوفة و محبة و متحمسة بعالم التطور الرقمي"
  },
  "description_info": {
    "main" :" بفضل فضولي الكبير وقدرتي الطبيعية على التعامل مع التقنيات الحديثة، أعمل باستمرار على تحسين مهاراتي. بدأت من قاعدة متواضعة في تصميم المواقع وتقنيات الويب، وتقدمت تدريجياً لأصبح مطوّرة ويب. أصبح تطوير الويب والهواتف المحمولة مصدر إلهامي وشغفي ومهنتي. من أجل تعزيز خبرتي، حصلت على دبلوم في تطوير الويب. كما أنني أرغب في التعمق في تطوير الواجهة الخلفية، بهدف توسيع مهاراتي وإتقان تقنيات متقدمة. أنا دائمًا حريصة على التعلم وأبحث باستمرار عن فرص وتحديات جديدة في مجال تطوير الويب ", 
    "mainI": "مطورة ويب حاصلة على شهادة في تطوير  الويب بفرنسا ، شغوفة و محبة و متحمسة جدا لتعلم كل جديد في عالم تطوير الويب ،كمتعلمة ذاتية اتطلع دائما لتعلم تقنيات جديدة لتحسين و صقل مهاراتي .\n إكتسبت  مهارات  و  خبرات  من  خلال  العمل  على  العديد  من  المشاريع  ،هدفي  هو  تقديم  حلول  ابداعية  و  مبتكرة  لأي  مشروع  أعمل  عليه و لدي فضول كبير و موهوبة بالتقنيات الجديدة، وأسعى باستمرار إلى تحسين مهاراتي، حيث علمت نفسي، بدءًا من بعض المعرفة بالويب ومصممة الويب، تمكنت من أن أصبح مطورة ويب.وأنا  جداً متحمسة دائمًا للتعلم واكتشاف الفرص الجديدة في مجال تطوير الويب ",



    "introduction": "أنا نسرين مُدمجة ويب ومطوّرة متحمسة لعالم تطوير الويب. كمتعلّمة ذاتية، أتعلم باستمرار تقنيات ونهجًا جديدة لتحسين مهاراتي وتقديم تجارب مستخدم فريدة. حاصلة على شهادة في تكامل الويب   ، وقد عملت على العديد من المشاريع الشخصية لتعزيز مهاراتي كمُدمجة ويب ومطوّرة هدفي هو الاستمرار في التعلّم والتطور كمحترفة في مجال تطوير الويب، مع تقديم حلول إبداعية ومبتكرة لأي مشروع ويب كمُدمجة ويب، اكتسبت خبرة قوية في تطوير مواقع ويب حديثة ووظيفية باستخدام أحدث التقنيات في مجال تطوير الويب. أنا أيضًا متحمسة لتصميم واجهات مستخدم جذابة وبديهية لتقديم تجارب مستخدم مثالية. أنا حاليًا أبحث عن وظيفة بدوام كامل أو بدوام جزئي، وأنا منفتحة لأي فرص جديدة "
  },

  "ErrorPage": {
    "message__title": "صفحة غير متاحة",
    "message__text": " نعتذر، الصفحة المطلوبة غير موجودة .",
    "message__btn": "العودة للصفحة الرئيسية"
  },
  "projectBooki": {
    "brief_description": " موقع يسمح لك بحجز فندق في اي مكان تريده و الإطلاع على الانشطة  الموجودة في ذلك المكان   ",
    "description_project": " بوكي  هو أول مشروع تطوير ويب عملت عليه في تدريب تكامل الويب  قمت بإنشاء موقع اعتمادا  على تصميم معد ، بدأت بتحليل التصميم تم تطبيقه. اتبعت أفضل ممارسات تطوير الويب واحترمت المعايير الجودة المعتمدة.كما تأكدت من أن الموقع الويب يكون متكيفًا، أي أنه يتكيف تلقائيًا مع أنواع وأحجام شاشات مختلفة "
  },
  "projectOhMyFood": {
    "brief_description": "موقع إلكتروني للمطاعم الفاخرة. يستطيع العملاء  تركيب قائمة الطعام الخاصة بهم قبل وصولهم حتى تكون الأطباق جاهزة حسب تفضيلاتهم",
    "description_project": " هو موقع ويب يستهدف الهواتف المحمولة، يقدم قوائم المطاعم الفاخرة. تمثلت مهمتي كمطورة ويب في هذا المشروع تحويل النماذج التي قدمها فريق التصميم إلى موقع ويب يعمل بشكل فعال ويتكيف مع الأجهزة المختلفة مثل الهواتف الذكية والأجهزة اللوحية وأجهزة الكمبيوتر المكتبية.\n وفي إطار هذا المشروع، كان علي تضمين الرسوم المتحركة والتصرفات المحددة في نموذج الموقع لتوفير تجربة مستخدم ممتازة وجذابة. هذه التجربة المهنية قدمت لي الفرصة لتطبيق مهاراتي في تكامل الويب وتقديم نتائج عالية الجودة في المواعيد المحددة"
  },
  "projectLaPantherre": {
    "brief_description": "هذا موقع ويب من وكالة ويب لإجراء تدقيق وتحليل واختبار وتعديلات SEO لموقع La Panthère من أجل إمكانية الوصول وتحسين الأداء مع احترام معايير W3C." ,
    "description_project": "وكالة La Panthère لتصميم المواقع الإلكترونية، هي موقع عرض محسّن باستخدام المرجعية الطبيعية، ويهدف إلى تقديم نتائج تدقيق تحسين محركات البحث (SEO) لموقع وكالة تصميم الويب La Panthère، والتي تحتوي على قائمة غير شاملة للممارسات السيئة التي لا تؤدي إلى أي ضرر. لا تساهم في المرجع الطبيعي الجيد للموقع بالإضافة إلى ضعف إمكانية الوصول والأداء المنخفض إلى حد ما"
  },
  "projectKanap": {
    "brief_description": "هذا موقع للتجارة الإلكترونية لبيع الأرائك باستخدام جافا سكريبت",
    "description_project": "كمطور، كنت مسؤولاً عن إنشاء موقع ديناميكي باستخدام جافا سكريبت، وهو موقع للتجارة الإلكترونية يبيع كاناب (صوفات) عبر الإنترنت، وذلك من خلال إنشاء صفحة المنتج لعرض المنتج، وصفحة السلة التي يمكن للمستخدم إضافة العناصر إليها إلى السلة، وفي هذه الحالة إذا لم تكن السلة فارغة سيقوم المستخدم بملء نموذج الاتصال وصفحة التأكيد التي تحتوي على تأكيد الطلب مع رقم الطلب"
  },
  "projectPicante": {
    "brief_description": "Picante هو تطبيق مراجعة في متجر إلكتروني، تريد الشركة أن يكون الإصدار الأول “معرض صلصة”",
    "description_project":  "شركة PICANTE تريد \n `HOT TAKES` تطوير تطبيق مراجعة لصلصاتها الساخنة يسمى  \n  وتحويله إلى متجر عبر الإنترنت  `HOT TAKES`وتريد أن يكون الإصدار الأول عبارة عن معرض صلصات  يسمح للمستخدمين بتحميل صلصاتهم الساخنة المفضلة وإبداء إعجابهم بالصلصات أو عدم إعجابهم بها التي يشاركها الآخرون، لذا فإن مهمتنا كمطور ويب هي إنشاء واجهة برمجة تطبيقات آمنة للتطبيق" 
  },
  "projectKasa": {
    "brief_description": " تطبيق مخصص لتأجير الشقق بمختلف انواعها بين الأفراد في فرنسا",
    "description_project": "تطبيق رائد في تأجير الشقق في فرنسا.\n  مهمتي كانت تجديد الموقع بإستخدام جافا سكريبت لجانب العميل  استعنت برياكت للعمل على الواجهة الأمامية ، كما كان لدي ملف جسون يحتوي على معلومات الشقق قمت بربطه مع الواجهة الأمامية ، كما استعنت بنموذج التصميم على منصة فيقما لانشاء موقع وظيفي و متكيف مع الأجهزة المختلفة مثل الهواتف الذكية والأجهزة اللوحية وأجهزة الكمبيوتر المكتبية."
  },
  "projectLesPetitsPlats": {
    "brief_description": "بعد نشر كتب الطبخ لعدة سنوات ، قررت شركة “Les petits plats” إنشاء موقع وصفات الطبخ الخاص بها مثل مارميتون أو 750 جرام.",
   "description_project":"كمطور ويب مستقل بتكليف من شركة “Les petits plats”  لإنشاء موقع وصفات طبخ خاص بها مثل Marmithon أو 750 جرام ، وتحقيق خوارزميتين منفصلتين ، الأولى بحلقة أصلية (for, while...) والآخر مع حلقة وظيفية (map ،forEach).تحديد أي خوارزمية يعمل بشكل أفضل ويعطي معظم النتائج مع JSBENCH."
},
"GameOn":{
  "brief_description": "GameOn هو مشروع لإنشاء صفحة مقصودة مع CSS، HTML  و JavaScript  وبالتالي فإن الهدف هو ممارسة أفضل JavaScript  ",
  "description_project": "يستخدم هذا المشروع لإنشاء صفحة ويب للتسجيل لحدث رياضي ماراثون, لذا فإن دورنا كمطور هو إنشاء هذه الصفحة عن طريق إضافة ميزات JavaScript حتى يتمكن المستخدم من التسجيل في هذا الحدث"
},
"Marathon":{
"brief_description":"يستخدم هذا المشروع لإنشاء موقع على شبكة الانترنت لحدث احتفالي الألعاب الأولمبية التي تحتوي على مختلف الأحداث الرياضية.",
"description_project": "إنشاء موقع على شبكة الانترنت بلغة البرمجة JavaScript، CSS HTML  و.تنفيذ الميزات التفاعلية مع JavaScript  لتحسين تجربة المستخدم.  تحقق من صحة إدخالات النموذج واعرض رسائل الخطأ المناسبة في حالة وجود بيانات غير صحيحة. أضف تفاعلات المستخدم ، مثل فتح وإغلاق نافذة مشروطة.تفاصيل التنفيذ."
},
  "service.description": {
    "web": "إنشاء مواقع العرض، وموقع التجارة الإلكترونية، وتكامل النماذج الديناميكية مع الموقع",
     "Mobile": "في عصر يهيمن عليه الهاتف المحمول، يعد التطبيق المصمم جيدًا أكثر من مجرد أداة. إنه اتصالك المباشر بالمستخدمين أينما كنت.",
    "Referencement": "يجمع كل الأساليب والتقنيات التي تهدف إلى وضع صفحات الويب الخاصة بموقعك",
    "Veille": "دائما على اطلاع على التكنولوجيات الجديدة ، وحريصة على توسيع مجال عملي من المهارات والمعرفة"
   
  },
  "Competence":{ 
    "question": "ماذا يمكنني أن أفعل؟",
    "prgI": "بصفتي مطورة متفانية وعاطفية ، أنا مقتنعة بأن مهاراتي الفنية ومهاراتي الشخصية مجتمعة تجعلني",
    "strongWordsI": "أصلا قيما", 
    "prgII": "من أجل بيئة مهنية متطلبة. من خلال استكمال تدريبي في إعادة التدريب المهني عن بعد ، من خلال كوني",  
    "strongWordsII":" عصاميية ، مستقلة ، مبدعة و صارمة",
    "prgIII": "والحصول على المهارات التقنية على النحو التالي",
    "softSkills__titleI":"ادارة مشروع",
    "softSkills__titleII":"ادارة فريق",
    "softSkills__titleIII":"علاقة العملاء", 
    "?":"؟",
    "titleI" : "الواجهة الأمامية",
   "titleII" : "الواجهة الخلفية",
   "titleIII" : "التصميم"
},
"TxtCertiPrg": { 
  "p":" بعد التدريب المتبع مع أوبن كلاسرومز لتصبح مطورة  ويب ، أثبتت قدرتي على العمل بشكل مستقل  و عن بعد ، كوني  عصامية وصارمة  و مجتهدة .",
  "lien" : "عرض الشهادات"
}, 
"TextInfo": {
  "info": "المعلومات القانونية",
  "infoI": "العرض والمبدأ",
  "infoII" :"إمكانية الوصول ",
  "infoIII" : "حقوق الملكية الفكرية",
  "infoVI" : "حماية الممتلكات والأشخاص-استخدام البيانات الشخصية",
  "infoVII" : "روابط النص التشعبي",

  "nom": "نسرين بكار يهوم",
  
  "p": "وفقا لأحكام المادة 6-ثالثا و 19 من القانون رقم 2004-575 المؤرخ 21 يونيو 2004 المتعلق بالثقة في الاقتصاد الرقمي ، والمعروف باسم ش. م. م. ، نبلغ زوار الموقع: هذه البيانات المرفقة ",
  "pI" : "معلومات عن المالك",
  "pS": " عنوان المالك:",
  "pS1":"    باريس، إيل دو فرانس",
  "pS2" : "مطورة الويب",
  "pII": " مؤسسة الموقع هي  رئيسة المنشور هي :",
  "pII1": " كيفية التواصل مع صانعة المنشور  :",
  "pIII" : "الشركة التي توفر الإقامة :  ",

  "pIII2" : "HOSTINGER INTERNATIONAL LTD", 
  "pr": " المكتب الرئيسي : 61 Lordou Vironos Street, 6023 Larnaca, Chypre ",
  "pr2" : " يمكن الوصول إليها بالوسائل التالية : https://www.hostinger.fr/contact  " ,
  "prI" : "أي مستخدم الإنترنت الذي يربط ويستخدم الموقع التالي",
  "prII" : "يعتبر من مستخدمي الموقع",
  "prIII" : "الموقع",

  "prIIII" : "",
  "pIIII" : "نسرين بكار يهوم  تسعى جاهدة لوصف على الموقع  المعلومات الأكثر دقة ممكنة (تخضع للتغييرات التي تم إجراؤها منذ نشرها على الإنترنت) ، ولكن لا يمكن أن تضمن الدقة والاكتمال والمعلومات الواردة في موقعها ، سواء كانت من صنعها أم لا. بالإضافة إلى ذلك ، يقر المستخدم باستخدام هذه المعلومات المقدمة (لأغراض المعلومات ، غير شاملة ومن المحتمل أن تتطور) تحت مسؤوليته الخاصة.",
  "pIIIII" : "جمع العديد من الخدمات ، في الحالة المتاحة للمستخدم. و هنا  تم تحديد أن الأخير يجب أن يظل صادقا وأن يظهر حسن النية تجاه المستخدمين المختلفين ونحو مطور الموقع      ",
  "prIIII1" : " يتم تحديث الموقع بانتظام من قبل ",
  
  "pT1": "سوف تكرس نفسها لبذل قصارى جهدها لاستعادة الوصول إلى الموقع التالي وستسعى بعد ذلك إلى إبلاغ المستخدمين مسبقا بتواريخ وأوقات الانقطاع. أن تكون خاضعا فقط لالتزام بالوسائل",
  "pT2" : "لا يمكن أن تكون مسؤولة عن الأضرار ، مهما كانت طبيعتها ، الناتجة عن عدم توفر الخدمة",
   "pT3" : "نسرين بكار يهوم هي المالك الحصري لجميع حقوق الملكية الفكرية أو تمتلك حقوق استخدام جميع العناصر التي يمكن الوصول إليها على الموقع ، سواء على الهيكل أو على المقالات والنصوص والرسومات والأيقونات والموسيقى التصويرية والبرامج", 
   "pT4" : "أي استنساخ كلي أو جزئي للموقع",
   "pT5" : "يحظر عرض أو إصدار أو تعديل كلي أو جزئي لأحد هذه العناصر ، بغض النظر عن الوسائل أو العملية المستخدمة ، ما لم يتم قبول كتابي مسبق من  ،  ",
   "pTT5" :"مالك الموقع", 
   "pT6" : "خلاف ذلك ، سيتم اعتباره بنفس طريقة الانتهاك ويخضع للملاحقة القضائية وفقا لأحكام المواد ل. 335-2 وما يليها من قانون الملكية الفكرية",
   "pT7" : "في فرنسا ، البيانات الشخصية ، على سبيل المثال ، محمية بموجب القانون رقم 78-87 المؤرخ 6 يناير 1978 والقانون رقم 2004-801 المؤرخ 6 أغسطس 2004،  المادة ل. 226-13 من القانون الجنائي والتوجيه الأوروبي المؤرخ 24 أكتوبر 1995.", 
   "pT8" : "",
   "pT9" : "قد تحتوي على روابط نص تشعبي تتيح الوصول إلى مواقع الويب الأخرى المنشورة والمدارة من قبل الناشر. لا يمكن تحميل الناشر المسؤولية بشكل مباشر أو غير مباشر في حالة عدم امتثال مواقع الجهات الخارجية المذكورة للأحكام القانونية",
   "pT10": "لا تجمع المعلومات الشخصية (وفقا للمادة 4 من القانون رقم 78-17 المؤرخ 06 يناير 1978) المتعلقة بالمستخدم باستثناء الحاجة إلى بعض الخدمات التي يقدمها الموقع الداخلي",
   "pT11": "يقدم المستخدم هذه البيانات مع الوعي الكامل للسبب ، ولا سيما عندما يشرع بنفسه في دخولها. ثم يتم شرحه لمستخدم الموقع",
   "pT12": "واجب أو عدم إدخال هذه المعلومات.  وفقا لأحكام المواد 38 وما يليها من القانون 78-17 المؤرخ 6 يناير 1978 فيما يتعلق بأجهزة الكمبيوتر والملفات والحريات المختلفة ، فإن أي مستخدم له الحق في الوصول إلى المعلومات والتصحيح والحذف والمعارضة لجميع المعلومات الشخصية المتعلقة به. لاستخدامها,   أرسل طلبك إلى",
   "pT13": "عن طريق البريد الإلكتروني",
   "pTT14" : "أو برسالة مكتوبة بخط اليد موقعة حسب الأصول ، مصحوبة بنسخة من وثيقة الهوية مع توقيع صاحب الوثيقة ، مع ذكر العنوان الذي يجب إعادة الإجابة إليه.", 
   "pT14" : "بدون معلومات شخصية لمستخدم الموقع",
   "pT15" : "لن يتم نشرها دون علم المستخدم ، مقايضة ، نقل ، تعيين على أي وسيلة للمجموعات. فقط افتراض الخلاص من الموقع التالي",
   "pT16" :" ومن مجمل حقوقه يأذن",
   "pT17" : "لنقل المعلومات إلى المشتري الذي سيكون بعد ذلك نفسه ملزما بنفس الالتزام بتخزين وتعديل المعلومات المتعلقة بمستخدم الموقع التالي",
   "pT18" : "هو في الامتثال للائحة العامة لحماية البيانات.",
   "pT19" : "قواعد البيانات محمية بموجب التزامات قانون 1 يوليو 1998 وبالتالي نقل التوجيه 96/9 المؤرخ 11 مارس 1996 المتعلق بالحماية القانونية لقواعد البيانات (قواعد البيانات)"

},
"contact": {
  "ErrorName": "يجب أن يحتوي اللقب على أحرف ومسافات فقط",
  "ErrorLastName": "يجب أن يحتوي الاسم على أحرف ومسافات فقط",
  "ErrorMail": "الرجاءإدخال عنوان بريد إلكتروني صالح",
    "ErrorMessage" :"الرجاء إدخال رسالتك",
  "alert":"يحتوي النموذج على أخطاء. يرجى تصحيح ذلك",
  "location": "باريس، فرنسا"
}, 
  "errors" :{
    "last_name" :"يجب أن يحتوي اللقب على أحرف ومسافات فقط", 
    "first_name": "يجب أن يحتوي الاسم على أحرف ومسافات فقط",
     "user_email": "الرجاءإدخال عنوان بريد إلكتروني صالح", 
     "message": "الرجاء إدخال رسالتك" 
  },
  "txtError":".عفوا! الصفحة التي تبحث عنها غير موجودة",
  "txtErrorI":"العودة إلى الصفحة الرئيسية"

}
