{
  "title": "Nesrine BEKKAR YAHOUM ",
  "description": "portfolio Nesrine BEKKAR YAHOUM Front-end and Fullstack web developer.in Ile De France",
  "photo_alt": "Nesrine BEKKAR YAHOUM",
  "logo_alt": "portfolio's logo",

  "home_title": "Home",
  "home_id": "Home",
  "home_path": "/#home",

  "Profil_id": "Profil",
  "Profil_title": "Profil",
  "Profil_path": "/#Profil",

  "skills_title": "Skills",
  "skills_id": "Skills",
  "skills_path": "/#Skills",

  "portfolio_title": "Portfolio",
  "portfolio_id": "Portfolio",
  "portfolio_path": "/#Portfolio",

  "service_title": "Services",
  "service_id": "services",
  "service_path": "/#Services",

  "contact_title": "Contact",
  "contact_id": "Contact",
  "contact_path": "/#Contact",
  "txtInfo":"More informations",
  "footer": "Copyright © 2023 - Nesrine BEKKAR YAHOUM  ",
  "Mentions": "Legal Notice",
  "plan": "Sitemap",

  "Download": "Download my CV",
  "all": "All",
  "software": "Software",
  "Mobile": "Mobile",
  "Technologies_used": "Technologies used",
  "Readmore": "Read more",
  "Send": "Submit",
  "firstName": "First Name",
  "lastName": "Last Name",
  "Email": "Email",
  "Message": "Message",
  "Demo": "Demo",
  "source_code": "Source code",
  "email_envoyer": "Your email has been successfully sent. I will get back to you as soon as possible",
  "WEB": "WEB",
  "Réferencement Naturel SEO" :"Search Engine Optimization",
  "Veille technologique": "Technology watch ",
  "rotate":"My Certifications",

  "myTextBlog": "The web development for me is an art that I express",
  "creativite" : "my creativity",
  "inspiration" : "my inspiration",
  "passion" : "my passion",
 
  "lan": "Welcome",
  "world": "World ",
  "Visiteurs": "Visitors",
  "Recruteur": "Recruiters",
  "Développeurs": "Developer",
  "dot":"?",

  "presentation": {
    "h1Text" : "Nesrine BEKKAR YAHOUM",
    "h2Text" : "Frontend, Fullstack Web developer"  
    },

  "main_heading": {
    "hello": "Hello ",
    "name": "I'm Nesrine",
    "static_desc": "I'am a frontend and full stack web developer",
    "dynamic_desc": "Passionate about the world of web development."
  },
  "description_info": {
    "main": "With a great curiosity and a natural aptitude for new technologies, I am constantly working to enhance my skills. Starting from a modest foundation in web design and web technologies, I have progressively evolved into a web developer. Web and mobile development has become both my source of inspiration, my passion, and my professional calling. To solidify my expertise, I obtained a degree in web development. I am also keen to further deepen my knowledge in backend development, with the aim of expanding my skills and mastering advanced technologies. Always eager to learn, I am continuously seeking new opportunities and challenges in the field of web development."
  },
  
  "ErrorPage": {
    "message__title": "Page Not Found",
    "message__text": " We're sorry, the page you were looking for isn't found here.",
    "message__btn": "Return to the home page"
  },

  "projectBooki": {
    "brief_description": "This is a website that offers the opportunity to book a hotel while allowing users to explore the various activities available in the region.",
    "description_project": "Booki is my very first web development project that I worked on during my training as a web integrator at OpenClassrooms.\n  My main role was to take the mockups provided by the UI design team and turn them into a functional web interface using HTML and CSS.\n The project started with a careful analysis of the mockups, which were available as Figma files for different screen sizes. Following best practices in web development and adhering to established quality standards, I worked on integrating the mockups using HTML and CSS. I also ensured that the website was fully responsive, meaning it could automatically adapt to different types and sizes of screens."
  },
  "projectOhMyFood": {
    "brief_description": "This is a website dedicated to gourmet restaurants, where customers have the opportunity to create their own menu before their arrival. ",
    "description_project": "OhMyFood is a mobile-first website dedicated to presenting menus offered by gourmet restaurants. As a Front-End developer, my role was to transform the mockups provided by the design team into a functional and responsive website, suitable for various devices such as smartphones, tablets, and desktop computers.\n As part of this project, I was also tasked with integrating the animations and behaviors specified in the site's prototype to provide an optimal and attractive user experience. This professional experience allowed me to put my web integration skills into practice and deliver a quality result within the given timeframe."
  },
  "projectLaPantherre": {
    "brief_description": "This is a website from a web agency to carry out an SEO audit analysis tests and modifications of the La Panthère site for Accessibility and Performance optimization while respecting W3C standards",
    "description_project": "The Panthere Web Design Agency, is a showcase site optimized with the application of natural referencing, aims to present to you the results of the SEO audit of the site of the web design agency La Panthère, containing a non-exhaustive list bad practices which do not contribute to good natural referencing of the site as well as poor accessibility and fairly low performance"
  },
  "projectKanap": {
    "brief_description": "This is an e-commerce site for selling sofas with javascript",
    "description_project": "As a developer, I was responsible for creating a dynamic site with javascript, it is an e-commerce site selling kanap (sofapes) online, by creating the product page to display the product, the shopping cart page to that the user can add the items to the basket, and in this case if the basket is not empty the user will fill out a contact form and the confirmation page which contains the confirmation of the order with the number of order"
  },
  "projectPicante": {
    "brief_description": "Picante is a review application in an online store, the company wants the first version to be a “sauce gallery",
    "description_project" :"As a developer, I was tasked by Kasa, leader in peer-to-peer apartment rental in France, to renovate their website. For this task, I used JavaScript for the client side and opted for React as the framework for the front end. I had access to 20 recent real estate listings in JSON format, which I worked on to create a functional and responsive website. I also used Figma to convert the mockups into React components and routes, which allowed me to ensure visual consistency while developing an interactive and friendly user interface." 
  },
  "projectKasa": {
    "brief_description": "Kasa is an application dedicated to peer-to-peer apartment rentals in France",
    "description_project": "As a developer, I was tasked by Kasa, a leading peer-to-peer apartment rental company in France, to renovate their website.\n For this task, I used JavaScript for the client-side and opted for React as the front-end framework. I had access to 20 recent real estate listings in JSON format, which I worked on to create a functional and responsive website.\n I also used Figma to convert the designs into React components and routes, ensuring visual consistency while developing an interactive and user-friendly interface."
  },

  "projectLesPetitsPlats": {
    "brief_description": "After having published cookbooks for several years, the company ”Les petits plats” decided to create its own cooking recipes website like Marmiton or 750g.",
   "description_project":"As a freelance web developer commissioned by the company 'Les petits plats' to create her own cooking recipe site like Marmiton or 750g, and realize two separate algorithms, the first with a native loop (for, while...) and the other with a functional loop (forEach, map).Define which algorithm works best and gives the most results with JSBENCH."
},

"GameOn":{
  "brief_description": "GameOn it is a project to create a landing page with HTML CSS and Javascript, so the goal is to better practice JavaScript",
  "description_project": "This project is used to create a registration web page for a Marathon sports event, so our role as a developer is to create this page by adding javascript features so that the user can register for this event"
},
"Marathon":{
"brief_description":"This project is used to create a website for a festive event the Olympic Games",
"description_project": "Create a website with HTML and CSS and JavaScript. 🎯 Implement interactive features with JavaScript to improve the user experience. ✅ Validate the form entries and display appropriate error messages in case of incorrect data. ⚙️ Add user interactions, such as opening and closing a modal window.🔧 Implementation details"
},


  "service.description":{
    "web": "Creation of showcase sites, e-commerce site, dynamic site Integration of models",
     "Mobile": "In a mobile-dominated era, a well-designed app is more than just a tool. It's your direct connection to your users, wherever you are.",
    "Referencement": " Encompasses all methods and techniques designed to optimize the positioning of your site’s web pages.",
    "Technology watch": "Always on the lookout for new technologies, and eager to expand my area of skills and knowledge"
  },
  "Competence":{ 
    "question": "What can I do?",
    "prgI": "As a dedicated and passionate developer, I am convinced that my technical skills and my soft skills combined make me",
    "strongWordsI": "a valuable asset",
    "prgII":"for a demanding professional environment. By completing my training in professional retraining remotely, by being",
    "strongWordsII":"Self-taught, Autonomous, creative, rigorous",  
    "prgIII": "and to have the technical skills as :",
    "softSkills__titleI":" Project management",
    "softSkills__titleII":"Team management",
    "softSkills__titleIII":"Customers relationship",
    "titleI" : "Front-end",
   "titleII" : "Back-end",
   "titleIII" : "Design"
}, 
"TxtCertiPrg": { 
  "p":"Following a training followed with OpenClassrooms to become a web developer, I demonstrated my ability to work independently and remotely, while being self-taught and rigorous.",
  "lien" : "View certificates"
}, 

"TextInfo":{
  "info": "LEGAL INFORMATION",
  "infoI": "Presentation and principle",
  "infoII" :"Accessibility ",
  "infoIII": "Intellectual Property Rights",
  "infoVI": "Protection of goods and persons - Use of personal data",
  "infoVII" : "hypertext Links",


  "p": "Corresponding to the provisions of Article 6-III and 19 of Law No. 2004-575 of June 21, 2004 relating to Confidence in the digital economy, known as the L.C.E.N., we inform visitors to the website: https://nesrinebekkar.com These attached data :",
  "pI": "Information about the owner: Nesrine BEKKAR YAHOUM",
  "pS": "Location address of the holder:",
  "pS1":"Paris, France",
  "pS2" : "The web developer is",
  "pII" :"The Founder of the website is the chief of this publication is: Nesrine BEKKAR YAHOUM How to get in touch with the Publication Decision-Maker:",
  "pIII" : "Company that provides accommodation:",
  "pIII1" : "HOSTINGER INTERNATIONAL LTD",
  "pr": " the head office : 61 Lordou Vironos Street, 6023 Larnaca, Chypre" ,
  "pr2" : "reachable by the following means : https://www.hostinger.fr/contact.",

  "prI" :"Any Internet user who connects and uses the following site",
  "prII" : "is considered as a user of the website",
  "prIII" : "the site",
  "prIIII" : "gathered several services, in the state, available to the user. It is specified here that the latter must remain honest and show good faith both towards the various users and towards the developer of the site nesrinebekkar.com.",
  "prIIII1":"The site  is updated regularly by",
  
  "pIIII" : "Nesrine BEKKAR YAHOUM strives to prescribe on the website nesrinebekkar.com the most accurate information possible (subject to changes made since they have been posted online), but cannot guarantee the accuracy, completeness and information contained on its site, whether or not they are of its own making. In addition, the user acknowledges using this information given (for information purposes, non-exhaustive and likely to evolve) under his sole responsibility.",
  "pIIIII" : "is generally accessible to users 24 / 24h, 7 / 7d, except in case of maintenance, scheduled or not, for maintenance needs or in case of force majeure. In case of impossibility of access to the service",

  "pT1" : "will devote itself to doing its best to restore access to the following site and will then endeavor to inform users in advance of the Dates & times of the interruption. Being subject only to an obligation of means",
  "pT2" : "can not be held responsible for damages, whatever the nature, resulting from an unavailability of the service",
  "pT3" : "Nesrine BEKKAR YAHOUM is the exclusive owner of all intellectual property rights or holds the rights to use all the elements accessible on the website, both on the structure and on the articles and texts, graphics, icons, soundtrack, software", 
  "pT4" : "Any total or partial reproduction of the site", 
  "pT5" : "display, edition, total or partial adaptation of one of these elements, regardless of the means or the process used, is prohibited, unless prior written acceptance of",
  "pTT5" : "the owner of the site", 
  "pT6" : "Otherwise, it will be considered in the same way as an infringement and liable to prosecution according to the provisions of Articles L.335-2 and following of the Intellectual Property Code",
  "pT7" : "In France, personal data are, for example, protected by law n ° 78-87 of January 6, 1978 and law n ° 2004-801 of August 6, 2004, article L. 226-13 of the Criminal Code and the European Directive dated October 24, 1995.", 
  "pT8" : "",
  "pT9" : "may contain hypertext links giving access to other websites published and managed by the Publisher. The Publisher cannot be held responsible directly or indirectly in the event that said third-party sites do not comply with the legal provisions",
  "pT10": "does not collect personal information (according to article 4 law n ° 78-17 of January 06, 1978) concerning the user except for the need for certain services offered by the internal site",
  "pT11": "The user offers these data with full awareness of the cause, in particular when he proceeds by himself to their entry. It is then explained to the user of the site",
  "pT12": "the duty or not to enter this information. In accordance with the provisions of articles 38 and following of Law 78-17 of January 6, 1978 in connection with computers, files and various freedoms, any user has a right of access to information, rectification, deletion and opposition to all personal information concerning him. To use it, send your request to",
  "pT13": "by email",
  "pTT14" : "or by handwritten letter duly signed, accompanied by a copy of the identity document with the signature of the holder of the document, mentioning the address to which the answer must be returned.",
  "pT14" : "Without personal information of the site user",
  "pT15" : "will not be published without the knowledge of the user, bartered, transferred, assigned on any medium to groups. Only the assumption of the redemption of the following site",
  "pT16" :"and of the entirety of his rights authorizes ",
   "pT17" : "to transfer the information to the purchaser who would then himself be bound by the same obligation to store and modify the information concerning the user of the following site",
  "pT18" : "is in compliance with the GDPR.",
  "pT19" : "The databases are protected by the obligations of the law of July 1, 1998 thus transposing Directive 96/9 of March 11, 1996 relating to the legal protection of databases (databases)"
},

"contact": {
  "ErrorName": "The name should only contain letters and spaces",
  "ErrorLastName": "The first name should only contain letters and spaces",
  "ErrorMail": "Please enter a valid e-mail address",
  "ErrorMessage" :"Please enter your message",
  "alert":"The form contains errors. Please correct it",
"location": "Paris, France"
},
  "errors" :{
    "last_name" :"The last name should only contain letters and spaces", 
    "first_name": "The first name should only contain letters and spaces",
     "user_email": "Please enter a valid e-mail address", 
     "message": "Please enter your message" 

  },
  "txtError":"Oops! The page you are looking for does not exist.",
  "txtErrorI":"Retour to the home page"

}
