{
  "title": "Nesrine BEKKAR YAHOUM ",
  "description": "portfolio Nesrine BEKKAR YAHOUM Développeuse web Front-end et Fullstack.sur Ile De France",
  "photo_alt": "Nesrine BEKKAR YAHOUM",
  "logo_alt": "",
  "home_title": "Accueil",
  "home_id": "Accueil",
  "home_path": "/#Accueil",
  "Profil_title": "Profil",
  "Profil_id": "Profil",
  "Profil_path": "/#Profil",
  "skills_title": "Compétences",
  "skills_id": "Compétences",
  "skills_path": "/#Compétences",
  "portfolio_title": "Portfolio",
  "portfolio_id": "Portfolio",
  "portfolio_path": "/#Portfolio",
  "contact_title": "Contact",
  "contact_id": "Contact",
  "contact_path": "/#Contact",
  "footer": "Tous droits réservés © 2023 - Nesrine BEKKAR YAHOUM",

  "main_heading": {
    "hello": "Bonjour",
    "last name": " BEKKAR YAHOUM",
    "first name": "Nesrine",
    "static_desc": " Je suis  développeuse web frontend ",
    "dynamic_desc": "passionnée par le monde du développement web"
  },
  "description_info": {
    "main": "Curieuse et passionnée  par les nouvelles technologies ,je cherche incessamment à améliorer mes compétences. Etant autodidacte partant du développement mobile je suis arrivée au développements web qui est devenu ma passion et ma profession.  Afin de renforcer mes compétences, j'ai obtenu un diplôme en intégration web de niveau Bac+2 ma passion pour le développement back-end me pousse également à explorer des technologies avancées telles que Node.js et MongoDB .\n  Je suis toujours enthousiaste à l'idée d'apprendre et de découvrir de nouvelles opportunités dans le domaine du développement web.",
    "introduction": " Je m'appelle Nesrine, et je suis  développeuse frontend passionnée par le monde du développement web. En tant qu'autodidacte, je suis constamment en train d'apprendre de nouvelles technologies et de nouvelles approches pour améliorer mes compétences et offrir des expériences utilisateur uniques.j'ai un diplôme en intégration web au niveau Bac+2, j'ai travaillé sur plusieurs projets personnels pour renforcer mes compétences en tant qu'intégratrice web et développeuse de Front-end. Mon objectif est de continuer à apprendre et à évoluer en tant que professionnelle du web, tout en offrant des solutions créatives et innovantes pour tout projet web.En tant qu'intégratrice web, j'ai acquis une solide expertise dans le développement de sites web modernes et fonctionnels en utilisant les dernières technologies en matière de développement web. Je suis également passionnée par la conception d'interfaces utilisateur attrayantes et intuitives pour offrir des expériences utilisateur optimales. Actuellement à la recherche d'un poste en CDI ou CDD, je suis ouverte à de nouvelles opportunités pour continuer à développer mes compétences et apporter ma contribution dans le domaine du développement web."
  },
  "Download": "Télécharger mon CV",
  "all": "Tout",
  "software": "Logiciel",
  "Mobile": "Mobile",
  "Technologies_used": "Technologies utilisées",
  "Readmore": "En savoir plus",
  "Send": "Envoyer",
  "firstName": "prénom",
  "lastName": "Nom",
  "Email": "Email",
  "Message": "Message",
  "Demo": "Démo",
  "source_code": "Code source",
  "email_envoyer": "Votre e-mail a bien été envoyé. Je reviendrai vers vous dans les plus brefs délais",
  "notFound": {
    "message__title": "Page non trouvée",
    "message__text": " Nous sommes désolés, la page que vous recherchez n'existe pas.",
    "message__btn": "Retourner sur la page d'accueil"
  },
  
  "projectBooki": {
    "brief_description": "Il s'agit d'un site web qui offre la possibilité de réserver un hôtel tout en permettant aux utilisateurs de découvrir les différentes activités disponibles dans la région",
    "description_project": "Booki est mon tout premier projet de développement web sur lequel j'ai travaillé lors de ma formation en tant qu'intégrateur web chez OpenClassrooms.\n Mon rôle principal était de prendre les maquettes fournies par l'équipe de conception UI et de les transformer en une interface web fonctionnelle en utilisant HTML et CSS.\n Le projet a commencé par l'analyse minutieuse des maquettes qui étaient disponibles sous forme de fichiers Figma, pour différentes tailles d'écran. En suivant les meilleures pratiques de développement web et en respectant les normes de qualité établies, j'ai travaillé sur l'intégration des maquettes en utilisant HTML et CSS. J'ai également veillé à ce que le site web soit entièrement responsive, c'est-à-dire qu'il puisse s'adapter automatiquement à différents types et tailles d'écrans."
  },
  "projectOhMyFood": {
    "brief_description": "Il s'agit d'un site web dédié aux restaurants gastronomiques, où les clients ont la possibilité de composer leur propre menu avant leur arrivée.",
    "description_project": "OhMyFood est un site web mobile-first dédié à la présentation des menus proposés par les restaurants gastronomiques.\n  Mon rôle en tant qu'intégratrice web était de transformer les maquettes fournies par l'équipe de conception en un site web fonctionnel et responsive, adapté aux différents dispositifs tels que les smartphones, tablettes et ordinateurs de bureau.\n  Dans le cadre de ce projet, j'ai également eu pour mission d'intégrer les animations et comportements spécifiés dans le prototype du site pour offrir une expérience utilisateur optimale et attrayante.\n  Cette expérience professionnelle m'a permis de mettre en pratique mes compétences en matière d'intégration web et de livrer un résultat de qualité dans les délais impartis."
  },
"projectLaPantherre": {
  "brief_description": "Il s'agit d'un site web d'une agence web pour faire un audit SEO,  une analyse, tests et modifications du site La Panthère pour optimisation Accessibilité et Performance en respectant les normes du W3C." ,
  "description_project": "La Panthère Agence de web Design, est un site vitrine optimisé avec l'application du réferencement naturel, a pour objectif de vous présenter les résultats de l'audit SEO du site l’agence de web design la Panthère, contenant une liste non-exhaustive des mauvaises pratiques qui ne contribuent pas à un bon référencement naturel du site ainsi qu'une accessibilité faible et des performances assez basses."
},
"projectKanap": {
  "brief_description": "Il s'agit d'un site e-commerce de vente des canapé avec javascript",
  "description_project": "En tant que développeur, j'ai été chargée de créer un site dynamique avec javascript, c'est un site e-commerce de vente kanap (les canapés) on ligne, en créant la page produit pour afficher le produit, la page panier pour que l'utilisateur puisse ajouter les articles dans le pannier,et dans ce cas là si le panier n'est pas vide l'utilisateur va remplir un formaulaire de contact et la page confirmation qui contient la confirmation de la commande avec le numéro de commande"
},
"projectPicante": {
  "brief_description": "Picante est une application  d'évaluation en une boutique en ligne, l'entreprise souhaite que la première version soit une « galerie de sauces »",
  "description_project": "entreprise du produit PICANTE souhaite désormais développer une application évaluation de ses sauces piquantes, appelée HOT TAKES, et la transformer à une boutique en ligne, elle souhaite que la première version soit une « galerie de sauces » permettant aux utilisateurs de télécharger leurs sauces piquantes préférées et de liker ou disliker les sauces que d'autres partagent, Donc notre mission en tant que développeur web est de construire une API sécurisé pour son application HOT TAKE."
},
  "projectKasa": {
    "brief_description": "Kasa est une application dédiée à la location d'appartements entre particuliers en France",
    "description_project": "En tant que développeur, j'ai été chargé par Kasa, leader de la location d'appartements entre particuliers en France, de rénover leur site web.\n Pour cette tâche, j'ai utilisé JavaScript pour le côté client et j'ai opté pour React comme framework pour le front-end. J'ai eu accès à 20 annonces immobilières récentes au format JSON, sur lesquelles j'ai travaillé pour créer un site web fonctionnel et responsive.\n J'ai également utilisé Figma pour convertir les maquettes en composants et routes React, ce qui m'a permis de garantir une cohérence visuelle tout en développant une interface utilisateur interactive et conviviale"
}
}