{
  "title": "Nesrine BEKKAR YAHOUM ",
  "description": "portfolio Nesrine BEKKAR YAHOUM Développeuse web Front-end et Fullstack.sur Ile De France",
  "photo_alt": "Nesrine BEKKAR YAHOUM",
  "logo_alt": "logo de portfolio", 

  "home_title": "Accueil",
  "home_id": "About",
  "home_path": "/#About",

  "Profil_title": "Profil",
  "Profil_id": "Profil",
  "Profil_path": "/#Profil",

  "skills_title": "Compétences",
  "skills_id": "Comptences",
  "#skills_path": "/#Competences",
  
  "portfolio_title": "Portfolio",
  "portfolio_id": "Portfolio",
  "portfolio_path": "/#Portfolio",

  "service_title": "Services",
  "service_id": "services",
  "service_path": "/#Services",
  
  "contact_title": "Contact",
  "contact_id": "Contact",
  "contact_path": "/#Contact",
  
  "txtInfo":"plus d'informations",
  "footer": "Tous droits réservés © 2023 - Nesrine BEKKAR YAHOUM",
  "Mentions": "Mentions légales",
   "plan": "Plan du site",

   "Download": "Télécharger mon CV",
   "all": "Tout",
   "software": "Logiciel",
   "Mobile": "Mobile",
   "Technologies_used": "Technologies utilisées",
   "Readmore": "En savoir plus",
   "Send": "Envoyer",
   "firstName": "prénom",
   "lastName": "Nom",
   "Email": "Email",
   "Message": "Message",
   "Demo": "Démo",
   "source_code": "Code source",
   "email_envoyer": "Votre e-mail a bien été envoyé. Je reviendrai vers vous dans les plus brefs délais",
   "WEB": "WEB",
   "Réferencement Naturel SEO" :"Réferencement Naturel SEO",
   "Veille technologique": "Veille Technologique",
   "rotate":"Mes Certifications",
 
   "myTextBlog": "le développement web pour moi est un art lequel j'exprime",
 "creativite" : "ma créativité",
 "inspiration" : "mon inspiration",
 "passion" : "ma passion",

   "lan": "Bonjour",
   "world": "Tout le monde",
   "Visiteurs": "Visiteurs",
   "Recruteurs": "Recruteurs",
   "Développeurs": "Développeurs",
   "dot":"?",
  "presentation": {
    "h1Text" : "Nesrine BEKKAR YAHOUM",
    "h2Text" : "développeur web - intégrateur"
    },
  "main_heading": {
    "hello": "Bonjour",
    "last name": " BEKKAR YAHOUM",
    "first name": "Nesrine",
    "static_desc": " Je suis une développeuse web frontend ",
    "dynamic_desc": "passionnée par le monde du développement web"
  },
  "description_info": {
    "main": "Trés curieuse et surdouée  par les nouvelles technologies ,je cherche incessamment à améliorer mes compétences, en étant autodidacte partante du quelques connaissances du web et webdesigner, je suis arrivée à devenir une développeuse web. Le développements web et mobile qui est devenu mon inspiration, ma passion et ma profession, et afin de renforcer mes compétences, j'ai obtenu un diplôme en dévevloppement web Bac+2, et  je souhaiterais aussi bien approfondire dans le développement back-end pour explorer mes acquis dans d'autres technologies avancées .\n  Je suis toujours enthousiaste à l'idée d'apprendre et de découvrir de nouvelles opportunités dans le domaine du développement web.",
    "introduction": " Je suis Nesrine, et je suis  développeuse frontend passionnée par le monde du développement web. En tant qu'autodidacte, je suis constamment en train d'apprendre de nouvelles technologies et de nouvelles approches pour améliorer mes compétences et offrir des expériences utilisateur uniques.j'ai un diplôme en intégration web au niveau Bac+2, j'ai travaillé sur plusieurs projets personnels pour renforcer mes compétences en tant qu'intégratrice web et développeuse de Front-end. Mon objectif est de continuer à apprendre et à évoluer en tant que professionnelle du web, tout en offrant des solutions créatives et innovantes pour tout projet web.En tant qu'intégratrice web, j'ai acquis une solide expertise dans le développement de sites web modernes et fonctionnels en utilisant les dernières technologies en matière de développement web. Je suis également passionnée par la conception d'interfaces utilisateur attrayantes et intuitives pour offrir des expériences utilisateur optimales. Actuellement à la recherche d'un poste en CDI ou CDD, je suis ouverte à de nouvelles opportunités pour continuer à développer mes compétences et apporter ma contribution dans le domaine du développement web."
  },
  

  "ErrorPage": {
    "message__title": "Page non trouvée",
    "message__text": " Nous sommes désolés, la page que vous recherchez n'existe pas.",
    "message__btn": "Retourner sur la page d'accueil"
  },

  "projectBooki": {
    "brief_description": "Il s'agit d'un site web qui offre la possibilité de réserver un hôtel tout en permettant aux utilisateurs de découvrir les différentes activités disponibles dans la région",
    "description_project": "Booki est mon tout premier projet de développement web sur lequel j'ai travaillé lors de ma formation en tant qu'intégrateur web chez OpenClassrooms.\n Mon rôle principal était de prendre les maquettes fournies par l'équipe de conception UI et de les transformer en une interface web fonctionnelle en utilisant HTML et CSS.\n Le projet a commencé par l'analyse minutieuse des maquettes qui étaient disponibles sous forme de fichiers Figma, pour différentes tailles d'écran. En suivant les meilleures pratiques de développement web et en respectant les normes de qualité établies, j'ai travaillé sur l'intégration des maquettes en utilisant HTML et CSS. J'ai également veillé à ce que le site web soit entièrement responsive, c'est-à-dire qu'il puisse s'adapter automatiquement à différents types et tailles d'écrans."
  },
  "projectOhMyFood": {
    "brief_description": "Il s'agit d'un site web dédié aux restaurants gastronomiques, où les clients ont la possibilité de composer leur propre menu avant leur arrivée.",
    "description_project": "OhMyFood est un site web mobile-first dédié à la présentation des menus proposés par les restaurants gastronomiques.\n  Mon rôle en tant qu'intégratrice web était de transformer les maquettes fournies par l'équipe de conception en un site web fonctionnel et responsive, adapté aux différents dispositifs tels que les smartphones, tablettes et ordinateurs de bureau.\n  Dans le cadre de ce projet, j'ai également eu pour mission d'intégrer les animations et comportements spécifiés dans le prototype du site pour offrir une expérience utilisateur optimale et attrayante.\n  Cette expérience professionnelle m'a permis de mettre en pratique mes compétences en matière d'intégration web et de livrer un résultat de qualité dans les délais impartis."
  },
"projectLaPantherre": {
  "brief_description": "Il s'agit d'un site web d'une agence web pour faire un audit SEO,  une analyse, tests et modifications du site La Panthère pour optimisation Accessibilité et Performance en respectant les normes du W3C." ,
  "description_project": "La Panthère Agence de web Design, est un site vitrine optimisé avec l'application du réferencement naturel, a pour objectif de vous présenter les résultats de l'audit SEO du site l’agence de web design la Panthère, contenant une liste non-exhaustive des mauvaises pratiques qui ne contribuent pas à un bon référencement naturel du site ainsi qu'une accessibilité faible et des performances assez basses."
},
"projectKanap": {
  "brief_description": "Il s'agit d'un site e-commerce de vente des canapé avec javascript",
  "description_project": "En tant que développeur, j'ai été chargée de créer un site dynamique avec javascript, c'est un site e-commerce de vente kanap (les canapés) on ligne, en créant la page produit pour afficher le produit, la page panier pour que l'utilisateur puisse ajouter les articles dans le pannier,et dans ce cas là si le panier n'est pas vide l'utilisateur va remplir un formaulaire de contact et la page confirmation qui contient la confirmation de la commande avec le numéro de commande"
},
"projectPicante": {
  "brief_description": "Picante est une application  d'évaluation en une boutique en ligne, l'entreprise souhaite que la première version soit une « galerie de sauces »",
  "description_project": "entreprise du produit PICANTE souhaite désormais développer une application évaluation de ses sauces piquantes, appelée HOT TAKES, et la transformer à une boutique en ligne, elle souhaite que la première version soit une « galerie de sauces » permettant aux utilisateurs de télécharger leurs sauces piquantes préférées et de liker ou disliker les sauces que d'autres partagent, Donc notre mission en tant que développeur web est de construire une API sécurisé pour son application HOT TAKE."
},
  "projectKasa": {
    "brief_description": "Kasa est une application dédiée à la location d'appartements entre particuliers en France",
    "description_project": "En tant que développeur, j'ai été chargé par Kasa, leader de la location d'appartements entre particuliers en France, de rénover leur site web.\n Pour cette tâche, j'ai utilisé JavaScript pour le côté client et j'ai opté pour React comme framework pour le front-end. J'ai eu accès à 20 annonces immobilières récentes au format JSON, sur lesquelles j'ai travaillé pour créer un site web fonctionnel et responsive.\n J'ai également utilisé Figma pour convertir les maquettes en composants et routes React, ce qui m'a permis de garantir une cohérence visuelle tout en développant une interface utilisateur interactive et conviviale"
},
"service.description": {
  "web":"Création des site vitrine, site e-commerce, site dynamique Intégration des maquettes",
   "Mobile":"Dans une ère dominée par le mobile, une application bien conçue est plus qu'un simple outil.",
   "Referencement":"englobe l'ensemble des méthodes et techniques qui visent à positionner les pages web de votre site",
   "Veille" :"Toujours à l'affût des nouvelles technologies"

},
  "Competence":{ 
    "question": "Qu'est ce que je sais faire ?",
    "prgI": "En tant que développeuse dévouée et passionnée, je suis convaincu que mes compétences techniques et mes soft skills combinées font de moi ",
   "strongWordsI": " un atout précieux ", 
    "prgII": "pour tout un environnement professionnel exigeant. En effectuant ma formation en reconversion professionnelle à distance, en étant",
    "strongWordsII":"Autodidacte, Autonome, créative, rigoureuse",
    "prgIII":"et de disposer des compétences techniques comme :",
    "softSkills__titleI":"Getion de projets",
    "softSkills__titleII":"Pilotage d'équipe",
    "softSkills__titleIII":"Relation clients", 
    "?":"؟"

  }, 
 
   "TxtCertiPrg": {
    "p": "Suite à une formation suivie chez Openclassrooms,  pour devenir une développeuse web j'ai appris et suivi des cours en ligne proposés par Openclassrooms, des certifications obtenues à l'issue des cours ",
    "lien": "Voir les certificats"
  }, 
  "TextInfo": {
  "info": "Informations légales",
  "infoI": " Présentation et principe",
  "infoII" :"Accessibilité ",
  "infoIII" : "Droit de propriété intellectuelle",
  "infoVI"  :"Protection des biens et personnes - Utilisation des données personnelles ",
  "infoVII" : "Liens hypertextes",
   "nom":"Nesrine BEKKAR YAHOUM",

  "p": "Correspondant aux dispositions de l'article 6-III et 19 de la Loi n* 2004-575 du 21 juin 2004 relative à la Confiance en l'économie numérique, dite L.C.E.N., nous informons les visiteurs du site internet : https://nesrinebekkar.com Ces données ci-jointes :",
  "pI" :"Information du propriétaire",
  "pS": "Adresse de localisation du titulaire : ",
  "pS1":"Paris, ile de France",
  "pS2": "La développeuse web est",
  "pII": "Le Fondateur du site internet est c'est le Chef de la publication est :",
  "pII1": "Par quel moyen entrer en contact avec le Décideur de publication : ",
  "pIII" : "Entreprise qui assure l'hébergement :",
  "pIII1" : " HOSTINGER INTERNATIONAL LTD", 
  "pr": " le siège social :61 Lordou Vironos Street, 6023 Larnaca, Chypre",
  "pr2" : "joignable par le moyen suivant : https://www.hostinger.fr/contact.",

  "prI" : "Tout internaute qui se connecte et utilise le site suivant",
  "prII" : "est considéré comme utilisateur du site internet",
  "prIII" : " Le site ",
  "prIIII" : "réuni plusieurs services, dans l'état, disponible pour les utilisateur. Il est ici précisé que ces derniers doivent rester honnête et faire preuve de bonne foi tant envers les différents utilisateurs qu'envers le développeur du site  ",
  "prIIII1" : "Le site est mis à jour de façon régulière par",

  "pIIII" : "Nesrine BEKKAR YAHOUM s'efforce de prescrire sur le site internet nesrinebekkar.com des informations les plus précises possibles (sous réserve de modifications apportées depuis leur mise en ligne), mais ne saurait affirmer l'exactitude, la complétude et les informations répandu sur son site, qu'elles soient ou non de son fait. En dépendance, l'utilisateur reconnaît utiliser ces informations données (à titre indicatif, non exhaustives et susceptibles d'évoluer) sous son unique responsabilité.",
  "pIIIII" : "est généralement accessible aux utilisateurs 24/24h, 7/7j, sauf en cas de maintenance, programmée ou pas, pour les besoins de la maintenance ou en cas de force majeure. En cas d'impossibilité d'accès au service",

  "pT1": " se devouera à faire de son mieux pour rétablir l'accès au site suivant et s'efforcera alors d'informer au préalable aux utilisateurs Dates & heures de l'interruption. N'étant subordonné qu'à une obligation de moyen, ",
   "pT2" : "ne saurait être tenu comme responsable des dommages, peu importe la nature, résultant d'une indisponibilité du service",
   "pT3" : "est le propriétaire exclusif de tous les droits de propriété intellectuelle ou détient les droits d'usage sur l'intégralité des éléments accessibles sur le site web, tant sur la structure que sur les articles et textes, graphismes, icônes, bande sonore, logiciels", 
   "pT4" : "Toute reproduction totale ou partielle du site",
   "pT5" : "affichage, edition, adaptation totale ou partielle de l'un de ces éléments, peu importe le moyen ou le procédé utilisé, est interdite, sauf acceptation écrite préalable de",
   "pTT5": " le propriétaire du site ",
   "pT6" : "Dans le cas contraire elle sera considérée de la même manière qu'une contrefaçon et passible de poursuite d'après les dispositions des articles L.335-2 et suivants du Code de Propriété Intellectuelle",
   "pT7" : "En France, les données personnelles sont par exemple protégées par la loi n° 78-87 du 6 janvier 1978 et la loi n° 2004-801 datant du 6 août 2004, l'article L. 226-13 du Code pénal et la Directive Européenne datant du 24 octobre 1995. ", 
   "pT8" : "",
   "pT9" : "peut contenir des liens hypertextes donnant accès à d'autres sites web édités et gérés  par l'Éditeur. L'Éditeur ne pourra être tenu responsable directement ou indirectement dans le cas où lesdits sites tiers ne respecteraient pas les dispositions légales.",
   "pT10": " ne collecte pas d'informations personnelles ( suivant l'article 4 loi n°78-17 du 06 janvier 1978) concernant l'utilisateur que pour le besoin de certains services proposés par le site interne ",
   "pT11": " L'usager offre ces données en toute conscience de cause, notamment lorsqu'il procède par lui-même à leur saisie. Il est alors expliqué à l'utilisateur du site",
   "pT12": "le devoir ou non de rentrer ces informations. Conformément aux dispositifs des articles 38 et suivants de la loi 78-17 du 6 janvier 1978 en lien avec l'informatique, aux fichiers et aux différentes libertés, n'importe quel utilisateur dispose d'un droit d'accès aux informations, de rectification, de suppression et d'opposition à toutes les informations personnelles qui le concerne. Pour l'utiliser, adressez votre demande à ",
   "pT13": "par mail",
   "pTT14" :"ou par lettre manuscrite dûement signée, jointe d'une copie du titre d'identité avec signature du titulaire du document, en mentionnant l'adresse à laquelle la réponse doit être retournée.",
   "pT14" : "Sans information personnelle de l'utilisateur du site",
   "pT15" : "ne sera publiée à l'insu de l'utilisateur, troquée, transférée, cédée sur un support quelconque à des groupes. Seule l'hypothèse du rachat du site suivant",
   "pT16" :"et de l'intégralité de ses droits autorise",
   "pT17" : " à céder les informations à l' acquéreur qui serait alors lui-même tenu à la même obligation de conservation et de modification des informations concernant l'utilisateur du site suivant ",
   "pT18" : "est en conformité avec le RGPD.",
   "pT19" : "Les bases de données sont protégées par les obligations de la loi du 1er juillet 1998 transposant ainsi la directive 96/9 du 11 mars 1996 relative à la protection juridique des BDD (bases de données)."
}
  
}